Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>нп_ЗаявкаНаОткрытиеПериода</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
								<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПояснениеОтсечки.Заголовок = нп_ДатыЗапретаИзменения.ТекстПоясненияЗаявки();
	НастроитьФормуПоСостоянию();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастроитьФормуПоСостоянию();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастроитьФормуПоСостоянию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборот3Клиент.НачатьОбработку(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПериодДосрочно(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Документ ещё не записан.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьПериодДосрочноЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения,
		НСтр("ru = 'Вернуть прежнюю дату запрета и удалить состояние открытого периода?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПериодДосрочноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьПериодДосрочноНаСервере();
	Прочитать();
	ПоказатьПредупреждение(, НСтр("ru = 'Период закрыт досрочно.'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоСостоянию()
	
	Согласован = нп_ДатыЗапретаИзменения.ДокументСогласован(Объект.Ссылка);
	ЕстьСостояние = нп_ДатыЗапретаИзменения.ЕстьДействующееСостояниеПоЗаявке(Объект.Ссылка);
	Полноправный = нп_ДатыЗапретаИзменения.ЭтоПолноправныйПользовательСеанса();
	
	ТолькоПросмотрДокумента = Согласован Или ЕстьСостояние;
	
	Элементы.ПериодС.ТолькоПросмотр = ТолькоПросмотрДокумента;
	Элементы.СрокДействия.ТолькоПросмотр = ТолькоПросмотрДокумента;
	Элементы.РазделДатыЗапрета.ТолькоПросмотр = ТолькоПросмотрДокумента;
	Элементы.Пользователь.ТолькоПросмотр = ТолькоПросмотрДокумента;
	Элементы.ПричинаОткрытия.ТолькоПросмотр = ТолькоПросмотрДокумента;
	Элементы.Объекты.ТолькоПросмотр = ТолькоПросмотрДокумента;
	Элементы.Ответственный.ТолькоПросмотр = Истина;
	
	Элементы.ОтправитьНаСогласование.Доступность = Не ТолькоПросмотрДокумента И ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ЗакрытьПериодДосрочно.Видимость = Полноправный;
	Элементы.ЗакрытьПериодДосрочно.Доступность = Полноправный И ЕстьСостояние;
	
	СостояниеДО = нп_ДатыЗапретаИзменения.СостояниеСогласованияДО(Объект.Ссылка);
	Элементы.СостояниеСогласования.Заголовок = СостояниеДО.Представление;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПериодДосрочноНаСервере()
	
	Документы.нп_ЗаявкаНаОткрытиеПериода.ЗакрытьПериодДосрочно(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти
